{
  "architectures": [
    "ChessBotModel"
  ],
  "auto_map": {
    "AutoConfig": "modeling_chessbot.ChessBotConfig",
    "AutoModel": "modeling_chessbot.ChessBotModel"
  },
  "d_ff": 1024,
  "d_model": 512,
  "max_position_embeddings": 64,
  "model_type": "chessbot",
  "num_heads": 8,
  "num_layers": 10,
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "vocab_size": 1929
}
